change_screen_size();
function change_screen_size()
{
    let screen_height = $(window).height();
    $('body').css("height",screen_height);
}
$(window).resize(()=>{
    change_screen_size();
});

//配列シャッフル
const shuffle = ([...array]) => {
    for (let i = array.length - 1; i >= 0; i--) {
      const j = Math.floor(Math.random() * (i + 1));
      [array[i], array[j]] = [array[j], array[i]];
    }
    return array;
}

//main
let member = [];
let stat = true;
$("#start_button").click(()=>{
    if(stat)
    {
        //ボタン表示を薄くする
        $(".button").css("opacity",".2");
        stat = false;

        $("#sub_text").text("抽選中...");

        const music_time = 4000;
        const deray_time = 8000;
        const span_time  = 50;

        let k = 0;
        let rand;
        $('#aud').get(0).play();
        let interval = setInterval(()=>{
            rand = Math.round(Math.random()*(data.length - 1) - 0.4);
            $("#main_text").text(data[rand][3]);

            k++
            if(k >= music_time/span_time)
            {
                clearInterval(interval);

                $("#sub_text").text(data[rand][0] + data[rand][1]);
                member.push(data[rand]);
                console.log(member);
                data.splice(rand,1);
            }
        },span_time);

        setTimeout(()=>{
            $(".button").css("opacity","1");
            stat = true;
        },deray_time+500);
    }
});


let data = [
    [
        "1年",
        "1H",
        3,
        "大川 ちひろ",
        "403130059@g.kochinet.ed.jp",
        1
    ],
    [
        "1年",
        "1H",
        3,
        "大川 ちひろ",
        "403130059@g.kochinet.ed.jp",
        2
    ],
    [
        "1年",
        "1H",
        4,
        "市川　泰誠",
        "4211302@g.kochinet.ed.jp",
        3
    ],
    [
        "1年",
        "1H",
        4,
        "市川　泰誠",
        "4211302@g.kochinet.ed.jp",
        4
    ],
    [
        "1年",
        "1H",
        5,
        "岡林 穂佳",
        "38313034@g.kochinet.ed.jp",
        5
    ],
    [
        "1年",
        "1H",
        5,
        "岡林 穂佳",
        "38313034@g.kochinet.ed.jp",
        6
    ],
    [
        "1年",
        "1H",
        6,
        "竹内  涼菜",
        "38513078@g.kochinet.ed.jp",
        7
    ],
    [
        "1年",
        "1H",
        6,
        "竹内  涼菜",
        "38513078@g.kochinet.ed.jp",
        8
    ],
    [
        "1年",
        "1H",
        7,
        "松下  珠妃",
        "37213158@g.kochinet.ed.jp",
        9
    ],
    [
        "1年",
        "1H",
        7,
        "松下  珠妃",
        "37213158@g.kochinet.ed.jp",
        10
    ],
    [
        "1年",
        "1H",
        8,
        "濱﨑　りんご",
        "37613004@g.kochinet.ed.jp",
        11
    ],
    [
        "1年",
        "1H",
        9,
        "門脇　永十",
        "37313098@g.kochinet.ed.jp",
        12
    ],
    [
        "1年",
        "1H",
        9,
        "門脇　永十",
        "37313098@g.kochinet.ed.jp",
        13
    ],
    [
        "1年",
        "1H",
        10,
        "和田 朋愛",
        "12113003@g.kochinet.ed.jp",
        14
    ],
    [
        "1年",
        "1H",
        11,
        "新納 有彩",
        "4171343@g.kochinet.ed.jp",
        15
    ],
    [
        "1年",
        "1H",
        11,
        "新納 有彩",
        "4171343@g.kochinet.ed.jp",
        16
    ],
    [
        "1年",
        "1H",
        12,
        "柴田 翔朱",
        "35513014@g.kochinet.ed.jp",
        17
    ],
    [
        "2年",
        "1H",
        14,
        "大野　絢弥音",
        "39312135@g.kochinet.ed.jp",
        18
    ],
    [
        "2年",
        "1H",
        14,
        "大野　絢弥音",
        "39312135@g.kochinet.ed.jp",
        19
    ],
    [
        "2年",
        "1H",
        15,
        "片岡   あさひ",
        "39312173@g.kochinet.ed.jp",
        20
    ],
    [
        "2年",
        "1H",
        15,
        "片岡   あさひ",
        "39312173@g.kochinet.ed.jp",
        21
    ],
    [
        "2年",
        "1H",
        16,
        "岡田　美柚",
        "12112307@g.kochinet.ed.jp",
        22
    ],
    [
        "2年",
        "1H",
        16,
        "岡田　美柚",
        "12112307@g.kochinet.ed.jp",
        23
    ],
    [
        "2年",
        "1H",
        17,
        "西出 明樹",
        "39312190@g.kochinet.ed.jp",
        24
    ],
    [
        "2年",
        "1H",
        17,
        "西出 明樹",
        "39312190@g.kochinet.ed.jp",
        25
    ],
    [
        "2年",
        "1H",
        18,
        "今西　章生汰",
        "37612001@g.kochinet.ed.jp",
        26
    ],
    [
        "2年",
        "1H",
        18,
        "今西　章生汰",
        "37612001@g.kochinet.ed.jp",
        27
    ],
    [
        "2年",
        "1H",
        19,
        "岡本　一希",
        "12112309@g.kochinet.ed.jp",
        28
    ],
    [
        "2年",
        "1H",
        19,
        "岡本　一希",
        "12112309@g.kochinet.ed.jp",
        29
    ],
    [
        "2年",
        "1H",
        20,
        "増井 虎汰郎",
        "37612005@g.kochinet.ed.jp",
        30
    ],
    [
        "2年",
        "1H",
        20,
        "増井 虎汰郎",
        "37612005@g.kochinet.ed.jp",
        31
    ],
    [
        "2年",
        "1H",
        21,
        "中村 渚紗",
        "37612010@g.kochinet.ed.jp",
        32
    ],
    [
        "2年",
        "1H",
        22,
        "西原　勇太",
        "12112526@g.kochinet.ed.jp",
        33
    ],
    [
        "2年",
        "1H",
        22,
        "西原　勇太",
        "12112526@g.kochinet.ed.jp",
        34
    ],
    [
        "2年",
        "1H",
        24,
        "岩本 太一",
        "12112304@g.kochinet.ed.jp",
        35
    ],
    [
        "2年",
        "1H",
        24,
        "岩本 太一",
        "12112304@g.kochinet.ed.jp",
        36
    ],
    [
        "2年",
        "1H",
        26,
        "長﨑 旺太",
        "12112221@g.kochinet.ed.jp",
        37
    ],
    [
        "2年",
        "1H",
        26,
        "長﨑 旺太",
        "12112221@g.kochinet.ed.jp",
        38
    ],
    [
        "2年",
        "1H",
        27,
        "山﨑　菜音",
        "12112137@g.kochinet.ed.jp",
        39
    ],
    [
        "2年",
        "1H",
        28,
        "荒木　千晶",
        "12112301@g.kochinet.ed.jp",
        40
    ],
    [
        "2年",
        "1H",
        28,
        "荒木　千晶",
        "12112301@g.kochinet.ed.jp",
        41
    ],
    [
        "2年",
        "1H",
        31,
        "竹中 真",
        "12112521@g.kochinet.ed.jp",
        42
    ],
    [
        "2年",
        "1H",
        31,
        "竹中 真",
        "12112521@g.kochinet.ed.jp",
        43
    ],
    [
        "2年",
        "1H",
        32,
        "西森　はるき",
        "12112527@g.kochinet.ed.jp",
        44
    ],
    [
        "2年",
        "1H",
        32,
        "西森　はるき",
        "12112527@g.kochinet.ed.jp",
        45
    ],
    [
        "3年",
        "1H",
        33,
        "松田　悠吾",
        "12111136@g.kochinet.ed.jp",
        46
    ],
    [
        "3年",
        "1H",
        33,
        "松田　悠吾",
        "12111136@g.kochinet.ed.jp",
        47
    ],
    [
        "3年",
        "1H",
        34,
        "大﨑　ひなた",
        "12111405@g.kochinet.ed.jp",
        48
    ],
    [
        "3年",
        "1H",
        34,
        "大﨑　ひなた",
        "12111405@g.kochinet.ed.jp",
        49
    ],
    [
        "3年",
        "1H",
        35,
        "西川 珠璃",
        "12111323@g.kochinet.ed.jp",
        50
    ],
    [
        "3年",
        "1H",
        35,
        "西川 珠璃",
        "12111323@g.kochinet.ed.jp",
        51
    ],
    [
        "3年",
        "1H",
        36,
        "宮﨑 優衣",
        "12111235@g.kochinet.ed.jp",
        52
    ],
    [
        "3年",
        "1H",
        36,
        "宮﨑 優衣",
        "12111235@g.kochinet.ed.jp",
        53
    ],
    [
        "3年",
        "1H",
        37,
        "木下  ゆみ",
        "12111312@g.kochinet.ed.jp",
        54
    ],
    [
        "3年",
        "1H",
        37,
        "木下  ゆみ",
        "12111312@g.kochinet.ed.jp",
        55
    ],
    [
        "3年",
        "1H",
        38,
        "畑山　心来",
        "12111130@g.kochinet.ed.jp",
        56
    ],
    [
        "3年",
        "1H",
        38,
        "畑山　心来",
        "12111130@g.kochinet.ed.jp",
        57
    ],
    [
        "3年",
        "1H",
        41,
        "森田　千遥",
        "12111637@g.kochinet.ed.jp",
        58
    ],
    [
        "3年",
        "1H",
        41,
        "森田　千遥",
        "12111637@g.kochinet.ed.jp",
        59
    ],
    [
        "3年",
        "1H",
        42,
        "斉家　あゆみ",
        "12111113@g.kochinet.ed.jp",
        60
    ],
    [
        "3年",
        "1H",
        42,
        "斉家　あゆみ",
        "12111113@g.kochinet.ed.jp",
        61
    ],
    [
        "3年",
        "1H",
        44,
        "德廣 新",
        "12111122@g.kochinet.ed.jp",
        62
    ],
    [
        "3年",
        "1H",
        44,
        "德廣 新",
        "12111122@g.kochinet.ed.jp",
        63
    ],
    [
        "3年",
        "1H",
        49,
        "山崎 瑛太",
        "12111440@g.kochinet.ed.jp",
        64
    ],
    [
        "3年",
        "1H",
        49,
        "山崎 瑛太",
        "12111440@g.kochinet.ed.jp",
        65
    ],
    [
        "3年",
        "1H",
        50,
        "掛水　楓斗",
        "12111207@g.kochinet.ed.jp",
        66
    ],
    [
        "3年",
        "1H",
        50,
        "掛水　楓斗",
        "12111207@g.kochinet.ed.jp",
        67
    ],
    [
        "1年",
        "2H",
        52,
        "氏原　慶大",
        "12113004@g.kochinet.ed.jp",
        68
    ],
    [
        "1年",
        "2H",
        53,
        "藤原　惇貴",
        "41913030@g.kochinet.ed.jp",
        69
    ],
    [
        "1年",
        "2H",
        53,
        "藤原　惇貴",
        "41913030@g.kochinet.ed.jp",
        70
    ],
    [
        "1年",
        "2H",
        54,
        "小川 桜花",
        "12113022@g.kochinet.ed.jp",
        71
    ],
    [
        "1年",
        "2H",
        54,
        "小川 桜花",
        "12113022@g.kochinet.ed.jp",
        72
    ],
    [
        "1年",
        "2H",
        55,
        "市川 未歩",
        "37713113@g.kochinet.ed.jp",
        73
    ],
    [
        "1年",
        "2H",
        55,
        "市川 未歩",
        "37713113@g.kochinet.ed.jp",
        74
    ],
    [
        "1年",
        "2H",
        56,
        "今井 はな",
        "38913003@g.kochinet.ed.jp",
        75
    ],
    [
        "1年",
        "2H",
        58,
        "寺村　優花",
        "41313022@g.kochinet.ed.jp",
        76
    ],
    [
        "1年",
        "2H",
        58,
        "寺村　優花",
        "41313022@g.kochinet.ed.jp",
        77
    ],
    [
        "1年",
        "2H",
        59,
        "田中    亜子",
        "403130070@g.kochinet.ed.jp",
        78
    ],
    [
        "1年",
        "2H",
        59,
        "田中    亜子",
        "403130070@g.kochinet.ed.jp",
        79
    ],
    [
        "1年",
        "2H",
        60,
        "松井 凛",
        "38813095@g.kochinet.ed.jp",
        80
    ],
    [
        "1年",
        "2H",
        61,
        "福原    由衣花",
        "403130017@g.kochinet.ed.jp",
        81
    ],
    [
        "1年",
        "2H",
        61,
        "福原    由衣花",
        "403130017@g.kochinet.ed.jp",
        82
    ],
    [
        "1年",
        "2H",
        62,
        "松﨑　馴知",
        "38613079@g.kochinet.ed.jp",
        83
    ],
    [
        "1年",
        "2H",
        62,
        "松﨑　馴知",
        "38613079@g.kochinet.ed.jp",
        84
    ],
    [
        "2年",
        "2H",
        63,
        "岡部　あおい",
        "12112608@g.kochinet.ed.jp",
        85
    ],
    [
        "2年",
        "2H",
        63,
        "岡部　あおい",
        "12112608@g.kochinet.ed.jp",
        86
    ],
    [
        "2年",
        "2H",
        64,
        "柿谷　玲奈",
        "12112610@g.kochinet.ed.jp",
        87
    ],
    [
        "2年",
        "2H",
        67,
        "田原　花",
        "12112418@g.kochinet.ed.jp",
        88
    ],
    [
        "2年",
        "2H",
        67,
        "田原　花",
        "12112418@g.kochinet.ed.jp",
        89
    ],
    [
        "2年",
        "2H",
        68,
        "弘松　希莉亜",
        "12112332@g.kochinet.ed.jp",
        90
    ],
    [
        "2年",
        "2H",
        68,
        "弘松　希莉亜",
        "12112332@g.kochinet.ed.jp",
        91
    ],
    [
        "2年",
        "2H",
        69,
        "畑中 悠希",
        "12112331@g.kochinet.ed.jp",
        92
    ],
    [
        "2年",
        "2H",
        69,
        "畑中 悠希",
        "12112331@g.kochinet.ed.jp",
        93
    ],
    [
        "2年",
        "2H",
        70,
        "松村 桃花",
        "39312093@g.kochinet.ed.jp",
        94
    ],
    [
        "2年",
        "2H",
        70,
        "松村 桃花",
        "39312093@g.kochinet.ed.jp",
        95
    ],
    [
        "2年",
        "2H",
        71,
        "柳村　碧海",
        "12112438@g.kochinet.ed.jp",
        96
    ],
    [
        "2年",
        "2H",
        71,
        "柳村　碧海",
        "12112438@g.kochinet.ed.jp",
        97
    ],
    [
        "2年",
        "2H",
        72,
        "甲藤　慶丈",
        "12112111@g.kochinet.ed.jp",
        98
    ],
    [
        "2年",
        "2H",
        72,
        "甲藤　慶丈",
        "12112111@g.kochinet.ed.jp",
        99
    ],
    [
        "2年",
        "2H",
        73,
        "山本 みるき",
        "12112337@g.kochinet.ed.jp",
        100
    ],
    [
        "2年",
        "2H",
        73,
        "山本 みるき",
        "12112337@g.kochinet.ed.jp",
        101
    ],
    [
        "2年",
        "2H",
        77,
        "田所 陽",
        "12112320@g.kochinet.ed.jp",
        102
    ],
    [
        "2年",
        "2H",
        77,
        "田所 陽",
        "12112320@g.kochinet.ed.jp",
        103
    ],
    [
        "2年",
        "2H",
        78,
        "野波　万怜",
        "12112126@g.kochinet.ed.jp",
        104
    ],
    [
        "2年",
        "2H",
        78,
        "野波　万怜",
        "12112126@g.kochinet.ed.jp",
        105
    ],
    [
        "2年",
        "2H",
        79,
        "石川　結理",
        "12112603@g.kochinet.ed.jp",
        106
    ],
    [
        "2年",
        "2H",
        81,
        "西村 悠陽",
        "12112226@g.kochinet.ed.jp",
        107
    ],
    [
        "2年",
        "2H",
        81,
        "西村 悠陽",
        "12112226@g.kochinet.ed.jp",
        108
    ],
    [
        "2年",
        "2H",
        82,
        "北村 芽生",
        "12112512@g.kochinet.ed.jp",
        109
    ],
    [
        "2年",
        "2H",
        82,
        "北村 芽生",
        "12112512@g.kochinet.ed.jp",
        110
    ],
    [
        "2年",
        "2H",
        84,
        "保木  萌",
        "12112334@g.kochinet.ed.jp",
        111
    ],
    [
        "2年",
        "2H",
        84,
        "保木  萌",
        "12112334@g.kochinet.ed.jp",
        112
    ],
    [
        "3年",
        "2H",
        85,
        "中村　匠",
        "12111224@g.kochinet.ed.jp",
        113
    ],
    [
        "3年",
        "2H",
        85,
        "中村　匠",
        "12111224@g.kochinet.ed.jp",
        114
    ],
    [
        "3年",
        "2H",
        86,
        "山岡 大起",
        "12111638@g.kochinet.ed.jp",
        115
    ],
    [
        "3年",
        "2H",
        86,
        "山岡 大起",
        "12111638@g.kochinet.ed.jp",
        116
    ],
    [
        "3年",
        "2H",
        87,
        "中山 惠太",
        "12111127@g.kochinet.ed.jp",
        117
    ],
    [
        "3年",
        "2H",
        87,
        "中山 惠太",
        "12111127@g.kochinet.ed.jp",
        118
    ],
    [
        "3年",
        "2H",
        88,
        "野島　千愛",
        "12111128@g.kochinet.ed.jp",
        119
    ],
    [
        "3年",
        "2H",
        88,
        "野島　千愛",
        "12111128@g.kochinet.ed.jp",
        120
    ],
    [
        "3年",
        "2H",
        89,
        "川村　凜",
        "12111610@g.kochinet.ed.jp",
        121
    ],
    [
        "3年",
        "2H",
        89,
        "川村　凜",
        "12111610@g.kochinet.ed.jp",
        122
    ],
    [
        "3年",
        "2H",
        90,
        "北村  優",
        "12111109@g.kochinet.ed.jp",
        123
    ],
    [
        "3年",
        "2H",
        90,
        "北村  優",
        "12111109@g.kochinet.ed.jp",
        124
    ],
    [
        "3年",
        "2H",
        91,
        "中村　郁美",
        "12111321@g.kochinet.ed.jp",
        125
    ],
    [
        "3年",
        "2H",
        91,
        "中村　郁美",
        "12111321@g.kochinet.ed.jp",
        126
    ],
    [
        "3年",
        "2H",
        92,
        "嶋本   一哉",
        "12111314@g.kochinet.ed.jp",
        127
    ],
    [
        "3年",
        "2H",
        92,
        "嶋本   一哉",
        "12111314@g.kochinet.ed.jp",
        128
    ],
    [
        "3年",
        "2H",
        93,
        "西内 心都",
        "12111226@g.kochinet.ed.jp",
        129
    ],
    [
        "3年",
        "2H",
        93,
        "西内 心都",
        "12111226@g.kochinet.ed.jp",
        130
    ],
    [
        "3年",
        "2H",
        94,
        "井上 碩也",
        "12113010@g.kochinet.ed.jp",
        131
    ],
    [
        "3年",
        "2H",
        94,
        "井上 碩也",
        "12113010@g.kochinet.ed.jp",
        132
    ],
    [
        "1年",
        "3H",
        95,
        "谷　一真",
        "35913043@g.kochinet.ed.jp",
        133
    ],
    [
        "1年",
        "3H",
        95,
        "谷　一真",
        "35913043@g.kochinet.ed.jp",
        134
    ],
    [
        "1年",
        "3H",
        96,
        "橋田　苺愛",
        "38413098@g.kochinet.ed.jp",
        135
    ],
    [
        "1年",
        "3H",
        96,
        "橋田　苺愛",
        "38413098@g.kochinet.ed.jp",
        136
    ],
    [
        "1年",
        "3H",
        97,
        "高橋　亜子",
        "38913067@g.kochinet.ed.jp",
        137
    ],
    [
        "1年",
        "3H",
        97,
        "高橋　亜子",
        "38913067@g.kochinet.ed.jp",
        138
    ],
    [
        "1年",
        "3H",
        98,
        "前田 真蔵",
        "12112131@g.kochinet.ed.jp",
        139
    ],
    [
        "1年",
        "3H",
        98,
        "前田 真蔵",
        "12112131@g.kochinet.ed.jp",
        140
    ],
    [
        "2年",
        "3H",
        100,
        "和田　拓真",
        "12112240@g.kochinet.ed.jp",
        141
    ],
    [
        "2年",
        "3H",
        100,
        "和田　拓真",
        "12112240@g.kochinet.ed.jp",
        142
    ],
    [
        "2年",
        "3H",
        102,
        "津野 小桜",
        "12112123@g.kochinet.ed.jp",
        143
    ],
    [
        "2年",
        "3H",
        102,
        "津野 小桜",
        "12112123@g.kochinet.ed.jp",
        144
    ],
    [
        "2年",
        "3H",
        103,
        "吉本　奏音",
        "12112139@g.kochinet.ed.jp",
        145
    ],
    [
        "2年",
        "3H",
        103,
        "吉本　奏音",
        "12112139@g.kochinet.ed.jp",
        146
    ],
    [
        "2年",
        "3H",
        104,
        "六久保　侑希",
        "39312064@g.kochinet.ed.jp",
        147
    ],
    [
        "2年",
        "3H",
        104,
        "六久保　侑希",
        "39312064@g.kochinet.ed.jp",
        148
    ],
    [
        "2年",
        "3H",
        105,
        "冨田 龍之介",
        "12112420@g.kochinet.ed.jp",
        149
    ],
    [
        "2年",
        "3H",
        109,
        "松田　眞飛",
        "42512059@g.kochinet.ed.jp",
        150
    ],
    [
        "2年",
        "3H",
        110,
        "織田 智聖",
        "12112110@g.kochinet.ed.jp",
        151
    ],
    [
        "2年",
        "3H",
        110,
        "織田 智聖",
        "12112110@g.kochinet.ed.jp",
        152
    ],
    [
        "2年",
        "3H",
        111,
        "中山　由瑞",
        "12112425@g.kochinet.ed.jp",
        153
    ],
    [
        "2年",
        "3H",
        112,
        "田村 優佳",
        "12111121@g.kochinet.ed.jp",
        154
    ],
    [
        "2年",
        "3H",
        112,
        "田村 優佳",
        "12111121@g.kochinet.ed.jp",
        155
    ],
    [
        "3年",
        "3H",
        115,
        "山下 亜衣莉",
        "12111139@g.kochinet.ed.jp",
        156
    ],
    [
        "3年",
        "3H",
        115,
        "山下 亜衣莉",
        "12111139@g.kochinet.ed.jp",
        157
    ],
    [
        "3年",
        "3H",
        116,
        "渡邊　哉太",
        "12111340@g.kochinet.ed.jp",
        158
    ],
    [
        "3年",
        "3H",
        116,
        "渡邊　哉太",
        "12111340@g.kochinet.ed.jp",
        159
    ],
    [
        "3年",
        "3H",
        117,
        "丁野　琉哉",
        "12111423@g.kochinet.ed.jp",
        160
    ],
    [
        "3年",
        "3H",
        117,
        "丁野　琉哉",
        "12111423@g.kochinet.ed.jp",
        161
    ],
    [
        "3年",
        "3H",
        118,
        "福本　紗也",
        "12111135@g.kochinet.ed.jp",
        162
    ],
    [
        "3年",
        "3H",
        118,
        "福本　紗也",
        "12111135@g.kochinet.ed.jp",
        163
    ],
    [
        "3年",
        "3H",
        119,
        "高木　智弘",
        "12111525@g.kochinet.ed.jp",
        164
    ],
    [
        "3年",
        "3H",
        119,
        "高木　智弘",
        "12111525@g.kochinet.ed.jp",
        165
    ],
    [
        "3年",
        "3H",
        120,
        "永野 妃奈乃",
        "12111126@g.kochinet.ed.jp",
        166
    ],
    [
        "3年",
        "3H",
        120,
        "永野 妃奈乃",
        "12111126@g.kochinet.ed.jp",
        167
    ],
    [
        "3年",
        "3H",
        121,
        "森木　葵",
        "39013098@g.kochinet.ed.jp",
        168
    ],
    [
        "3年",
        "3H",
        121,
        "森木　葵",
        "39013098@g.kochinet.ed.jp",
        169
    ],
    [
        "1年",
        "4H",
        122,
        "西村　夏穂",
        "37813026@g.kochinet.ed.jp",
        170
    ],
    [
        "1年",
        "4H",
        122,
        "西村　夏穂",
        "37813026@g.kochinet.ed.jp",
        171
    ],
    [
        "1年",
        "4H",
        123,
        "野中　美里",
        "38313047@g.kochinet.ed.jp",
        172
    ],
    [
        "1年",
        "4H",
        123,
        "野中　美里",
        "38313047@g.kochinet.ed.jp",
        173
    ],
    [
        "1年",
        "4H",
        124,
        "戸梶　勝政",
        "38913075@g.kochinet.ed.jp",
        174
    ],
    [
        "1年",
        "4H",
        124,
        "戸梶　勝政",
        "38913075@g.kochinet.ed.jp",
        175
    ],
    [
        "1年",
        "4H",
        126,
        "坂田 葵",
        "37913100@g.kochinet.ed.jp",
        176
    ],
    [
        "1年",
        "4H",
        127,
        "生田　眞裕",
        "38113001@g.kochinet.ed.jp",
        177
    ],
    [
        "1年",
        "4H",
        127,
        "生田　眞裕",
        "38113001@g.kochinet.ed.jp",
        178
    ],
    [
        "1年",
        "4H",
        128,
        "武市 驍",
        "39313212@g.kochinet.ed.jp",
        179
    ],
    [
        "1年",
        "4H",
        128,
        "武市 驍",
        "39313212@g.kochinet.ed.jp",
        180
    ],
    [
        "1年",
        "4H",
        130,
        "殿村　寛太",
        "37813023@g.kochinet.ed.jp",
        181
    ],
    [
        "1年",
        "4H",
        130,
        "殿村　寛太",
        "37813023@g.kochinet.ed.jp",
        182
    ],
    [
        "1年",
        "4H",
        131,
        "原　有由",
        "12113013@g.kochinet.ed.jp",
        183
    ],
    [
        "1年",
        "4H",
        131,
        "原　有由",
        "12113013@g.kochinet.ed.jp",
        184
    ],
    [
        "1年",
        "4H",
        132,
        "門脇   大晟",
        "37313009@g.kochinet.ed.jp",
        185
    ],
    [
        "1年",
        "4H",
        132,
        "門脇   大晟",
        "37313009@g.kochinet.ed.jp",
        186
    ],
    [
        "1年",
        "4H",
        133,
        "岡崎　力丸",
        "41913005@g.kochinet.ed.jp",
        187
    ],
    [
        "1年",
        "4H",
        133,
        "岡崎　力丸",
        "41913005@g.kochinet.ed.jp",
        188
    ],
    [
        "1年",
        "4H",
        134,
        "笹岡 日向",
        "40913290@g.kochinet.ed.jp",
        189
    ],
    [
        "1年",
        "4H",
        134,
        "笹岡 日向",
        "40913290@g.kochinet.ed.jp",
        190
    ],
    [
        "1年",
        "4H",
        136,
        "吉良　愛実",
        "36913019@g.kochinet.ed.jp",
        191
    ],
    [
        "1年",
        "4H",
        136,
        "吉良　愛実",
        "36913019@g.kochinet.ed.jp",
        192
    ],
    [
        "2年",
        "4H",
        138,
        "氏原 愛理",
        "12112405@g.kochinet.ed.jp",
        193
    ],
    [
        "2年",
        "4H",
        138,
        "氏原 愛理",
        "12112405@g.kochinet.ed.jp",
        194
    ],
    [
        "2年",
        "4H",
        139,
        "林　慶太",
        "12112630@g.kochinet.ed.jp",
        195
    ],
    [
        "2年",
        "4H",
        139,
        "林　慶太",
        "12112630@g.kochinet.ed.jp",
        196
    ],
    [
        "2年",
        "4H",
        141,
        "公文 晴基",
        "12112614@g.kochinet.ed.jp",
        197
    ],
    [
        "2年",
        "4H",
        141,
        "公文 晴基",
        "12112614@g.kochinet.ed.jp",
        198
    ],
    [
        "2年",
        "4H",
        142,
        "橋詰　暁伸",
        "3741217@g.kochinet.ed.jp",
        199
    ],
    [
        "2年",
        "4H",
        143,
        "原 條仁",
        "12112529@g.kochinet.ed.jp",
        200
    ],
    [
        "2年",
        "4H",
        144,
        "鳥越　心",
        "12112422@g.kochinet.ed.jp",
        201
    ],
    [
        "2年",
        "4H",
        144,
        "鳥越　心",
        "12112422@g.kochinet.ed.jp",
        202
    ],
    [
        "2年",
        "4H",
        146,
        "安養寺　蓮",
        "12112601@g.kochinet.ed.jp",
        203
    ],
    [
        "2年",
        "4H",
        146,
        "安養寺　蓮",
        "12112601@g.kochinet.ed.jp",
        204
    ],
    [
        "2年",
        "4H",
        147,
        "宮内　梨安",
        "37212147@g.kochinet.ed.jp",
        205
    ],
    [
        "2年",
        "4H",
        147,
        "宮内　梨安",
        "37212147@g.kochinet.ed.jp",
        206
    ],
    [
        "2年",
        "4H",
        148,
        "瀬尾　生恭",
        "12112211@g.kochinet.ed.jp",
        207
    ],
    [
        "2年",
        "4H",
        148,
        "瀬尾　生恭",
        "12112211@g.kochinet.ed.jp",
        208
    ],
    [
        "2年",
        "4H",
        149,
        "田中 夏海",
        "12112522@g.kochinet.ed.jp",
        209
    ],
    [
        "2年",
        "4H",
        149,
        "田中 夏海",
        "12112522@g.kochinet.ed.jp",
        210
    ],
    [
        "2年",
        "4H",
        150,
        "桒本　新太",
        "12112113@g.kochinet.ed.jp",
        211
    ],
    [
        "2年",
        "4H",
        150,
        "桒本　新太",
        "12112113@g.kochinet.ed.jp",
        212
    ],
    [
        "2年",
        "4H",
        153,
        "山下 詩織",
        "37212118@g.kochinet.ed.jp",
        213
    ],
    [
        "2年",
        "4H",
        153,
        "山下 詩織",
        "37212118@g.kochinet.ed.jp",
        214
    ],
    [
        "2年",
        "4H",
        154,
        "谷本  葵",
        "12112622@g.kochinet.ed.jp",
        215
    ],
    [
        "2年",
        "4H",
        155,
        "森本　三葉",
        "3751208@g.kochinet.ed.jp",
        216
    ],
    [
        "2年",
        "4H",
        155,
        "森本　三葉",
        "3751208@g.kochinet.ed.jp",
        217
    ],
    [
        "2年",
        "4H",
        156,
        "西森　裕貴",
        "12112330@g.kochinet.ed.jp",
        218
    ],
    [
        "2年",
        "4H",
        156,
        "西森　裕貴",
        "12112330@g.kochinet.ed.jp",
        219
    ],
    [
        "2年",
        "4H",
        157,
        "二俣　朔也",
        "12112333@g.kochinet.ed.jp",
        220
    ],
    [
        "2年",
        "4H",
        157,
        "二俣　朔也",
        "12112333@g.kochinet.ed.jp",
        221
    ],
    [
        "2年",
        "4H",
        158,
        "山下 凉禾",
        "12112335@g.kochinet.ed.jp",
        222
    ],
    [
        "2年",
        "4H",
        158,
        "山下 凉禾",
        "12112335@g.kochinet.ed.jp",
        223
    ],
    [
        "2年",
        "4H",
        159,
        "島村　啓太郎",
        "12111116@g.kochinet.ed.jp",
        224
    ],
    [
        "2年",
        "4H",
        159,
        "島村　啓太郎",
        "12111116@g.kochinet.ed.jp",
        225
    ],
    [
        "3年",
        "4H",
        160,
        "濱田泰圭",
        "12111131@g.kochinet.ed.jp",
        226
    ],
    [
        "3年",
        "4H",
        160,
        "濱田泰圭",
        "12111131@g.kochinet.ed.jp",
        227
    ],
    [
        "3年",
        "4H",
        161,
        "福井　勝二朗",
        "12111329@g.kochinet.ed.jp",
        228
    ],
    [
        "3年",
        "4H",
        161,
        "福井　勝二朗",
        "12111329@g.kochinet.ed.jp",
        229
    ],
    [
        "3年",
        "4H",
        162,
        "伊藤  陽菜",
        "12111203@g.kochinet.ed.jp",
        230
    ],
    [
        "3年",
        "4H",
        162,
        "伊藤  陽菜",
        "12111203@g.kochinet.ed.jp",
        231
    ],
    [
        "3年",
        "4H",
        163,
        "中山 華蓮",
        "12111531@g.kochinet.ed.jp",
        232
    ],
    [
        "3年",
        "4H",
        163,
        "中山 華蓮",
        "12111531@g.kochinet.ed.jp",
        233
    ],
    [
        "3年",
        "4H",
        164,
        "小笠原 大河",
        "12111307@g.kochinet.ed.jp",
        234
    ],
    [
        "3年",
        "4H",
        164,
        "小笠原 大河",
        "12111307@g.kochinet.ed.jp",
        235
    ],
    [
        "3年",
        "4H",
        165,
        "小松 柊斗",
        "12111519@g.kochinet.ed.jp",
        236
    ],
    [
        "3年",
        "4H",
        165,
        "小松 柊斗",
        "12111519@g.kochinet.ed.jp",
        237
    ],
    [
        "3年",
        "4H",
        166,
        "橋本　修乃介",
        "12111630@g.kochinet.ed.jp",
        238
    ],
    [
        "3年",
        "4H",
        166,
        "橋本　修乃介",
        "12111630@g.kochinet.ed.jp",
        239
    ],
    [
        "3年",
        "4H",
        168,
        "中田　美香子",
        "12111626@g.kochinet.ed.jp",
        240
    ],
    [
        "3年",
        "4H",
        168,
        "中田　美香子",
        "12111626@g.kochinet.ed.jp",
        241
    ],
    [
        "3年",
        "4H",
        169,
        "細川 未羽",
        "12111332@g.kochinet.ed.jp",
        242
    ],
    [
        "3年",
        "4H",
        169,
        "細川 未羽",
        "12111332@g.kochinet.ed.jp",
        243
    ],
    [
        "3年",
        "4H",
        170,
        "原山 そら",
        "12111632@g.kochinet.ed.jp",
        244
    ],
    [
        "3年",
        "4H",
        171,
        "柏井 鴻輝",
        "12111512@g.kochinet.ed.jp",
        245
    ],
    [
        "3年",
        "4H",
        171,
        "柏井 鴻輝",
        "12111512@g.kochinet.ed.jp",
        246
    ],
    [
        "3年",
        "4H",
        172,
        "高松 泰羅",
        "12111422@g.kochinet.ed.jp",
        247
    ],
    [
        "3年",
        "4H",
        172,
        "高松 泰羅",
        "12111422@g.kochinet.ed.jp",
        248
    ],
    [
        "3年",
        "4H",
        173,
        "常石　藍花",
        "12111317@g.kochinet.ed.jp",
        249
    ],
    [
        "3年",
        "4H",
        173,
        "常石　藍花",
        "12111317@g.kochinet.ed.jp",
        250
    ],
    [
        "3年",
        "4H",
        174,
        "杉本 渚",
        "12111522@g.kochinet.ed.jp",
        251
    ],
    [
        "3年",
        "4H",
        175,
        "弘瀬　蒼真",
        "12111229@g.kochinet.ed.jp",
        252
    ],
    [
        "3年",
        "4H",
        175,
        "弘瀬　蒼真",
        "12111229@g.kochinet.ed.jp",
        253
    ],
    [
        "3年",
        "4H",
        176,
        "江西　大海",
        "12111204@g.kochinet.ed.jp",
        254
    ],
    [
        "3年",
        "4H",
        176,
        "江西　大海",
        "12111204@g.kochinet.ed.jp",
        255
    ],
    [
        "3年",
        "4H",
        177,
        "島本   芽",
        "12111214@g.kochinet.ed.jp",
        256
    ],
    [
        "3年",
        "4H",
        177,
        "島本   芽",
        "12111214@g.kochinet.ed.jp",
        257
    ],
    [
        "3年",
        "4H",
        178,
        "平山　高大",
        "12111328@g.kochinet.ed.jp",
        258
    ],
    [
        "3年",
        "4H",
        178,
        "平山　高大",
        "12111328@g.kochinet.ed.jp",
        259
    ],
    [
        "3年",
        "4H",
        179,
        "嶋岡　輝",
        "12111420@g.kochinet.ed.jp",
        260
    ],
    [
        "3年",
        "4H",
        179,
        "嶋岡　輝",
        "12111420@g.kochinet.ed.jp",
        261
    ],
    [
        "3年",
        "4H",
        180,
        "島崎 晃輔",
        "37213078@g.kochinet.ed.jp",
        262
    ],
    [
        "3年",
        "4H",
        180,
        "島崎 晃輔",
        "37213078@g.kochinet.ed.jp",
        263
    ],
    [
        "1年",
        "5H",
        182,
        "黒原　帆南美",
        "39213006@g.kochinet.ed.jp",
        264
    ],
    [
        "1年",
        "5H",
        182,
        "黒原　帆南美",
        "39213006@g.kochinet.ed.jp",
        265
    ],
    [
        "1年",
        "5H",
        183,
        "多田 美涼",
        "42513011@g.kochinet.ed.jp",
        266
    ],
    [
        "1年",
        "5H",
        183,
        "多田 美涼",
        "42513011@g.kochinet.ed.jp",
        267
    ],
    [
        "1年",
        "5H",
        184,
        "山崎　綾香",
        "37313059@g.kochinet.ed.jp",
        268
    ],
    [
        "1年",
        "5H",
        184,
        "山崎　綾香",
        "37313059@g.kochinet.ed.jp",
        269
    ],
    [
        "1年",
        "5H",
        185,
        "岩﨑　素宙",
        "41213005@g.kochinet.ed.jp",
        270
    ],
    [
        "1年",
        "5H",
        185,
        "岩﨑　素宙",
        "41213005@g.kochinet.ed.jp",
        271
    ],
    [
        "1年",
        "5H",
        186,
        "千光士　心",
        "35913010@g.kochinet.ed.jp",
        272
    ],
    [
        "1年",
        "5H",
        186,
        "千光士　心",
        "35913010@g.kochinet.ed.jp",
        273
    ],
    [
        "1年",
        "5H",
        187,
        "小笠原   冬苗",
        "38413041@g.kochinet.ed.jp",
        274
    ],
    [
        "1年",
        "5H",
        187,
        "小笠原   冬苗",
        "38413041@g.kochinet.ed.jp",
        275
    ],
    [
        "1年",
        "5H",
        188,
        "白竹　真博",
        "35413001@g.kochinet.ed.jp",
        276
    ],
    [
        "1年",
        "5H",
        188,
        "白竹　真博",
        "35413001@g.kochinet.ed.jp",
        277
    ],
    [
        "1年",
        "5H",
        189,
        "岩原　和花",
        "39513024@g.kochinet.ed.jp",
        278
    ],
    [
        "1年",
        "5H",
        194,
        "森国　勇大",
        "39312130@g.kochinet.ed.jp",
        279
    ],
    [
        "1年",
        "5H",
        194,
        "森国　勇大",
        "39312130@g.kochinet.ed.jp",
        280
    ],
    [
        "2年",
        "5H",
        195,
        "齋田　海里",
        "37212101@g.kochinet.ed.jp",
        281
    ],
    [
        "2年",
        "5H",
        195,
        "齋田　海里",
        "37212101@g.kochinet.ed.jp",
        282
    ],
    [
        "2年",
        "5H",
        196,
        "和田　希成",
        "37212090@g.kochinet.ed.jp",
        283
    ],
    [
        "2年",
        "5H",
        196,
        "和田　希成",
        "37212090@g.kochinet.ed.jp",
        284
    ],
    [
        "2年",
        "5H",
        197,
        "濵田　秀哉",
        "12112628@g.kochinet.ed.jp",
        285
    ],
    [
        "2年",
        "5H",
        197,
        "濵田　秀哉",
        "12112628@g.kochinet.ed.jp",
        286
    ],
    [
        "2年",
        "5H",
        198,
        "瀧田　純",
        "12112213@g.kochinet.ed.jp",
        287
    ],
    [
        "2年",
        "5H",
        198,
        "瀧田　純",
        "12112213@g.kochinet.ed.jp",
        288
    ],
    [
        "2年",
        "5H",
        199,
        "下總 彩夏",
        "39312104@g.kochinet.ed.jp",
        289
    ],
    [
        "2年",
        "5H",
        200,
        "中澤 基",
        "12112525@g.kochinet.ed.jp",
        290
    ],
    [
        "2年",
        "5H",
        200,
        "中澤 基",
        "12112525@g.kochinet.ed.jp",
        291
    ],
    [
        "2年",
        "5H",
        201,
        "堀内   十和子",
        "39312091@g.kochinet.ed.jp",
        292
    ],
    [
        "2年",
        "5H",
        201,
        "堀内   十和子",
        "39312091@g.kochinet.ed.jp",
        293
    ],
    [
        "2年",
        "5H",
        202,
        "濱田　俊",
        "12112629@g.kochinet.ed.jp",
        294
    ],
    [
        "2年",
        "5H",
        202,
        "濱田　俊",
        "12112629@g.kochinet.ed.jp",
        295
    ],
    [
        "2年",
        "5H",
        203,
        "佐々木　寛文",
        "12112516@g.kochinet.ed.jp",
        296
    ],
    [
        "2年",
        "5H",
        203,
        "佐々木　寛文",
        "12112516@g.kochinet.ed.jp",
        297
    ],
    [
        "2年",
        "5H",
        204,
        "鍋島 渚",
        "12112327@g.kochinet.ed.jp",
        298
    ],
    [
        "2年",
        "5H",
        204,
        "鍋島 渚",
        "12112327@g.kochinet.ed.jp",
        299
    ],
    [
        "2年",
        "5H",
        205,
        "吉村　怜",
        "12112339@g.kochinet.ed.jp",
        300
    ],
    [
        "2年",
        "5H",
        205,
        "吉村　怜",
        "12112339@g.kochinet.ed.jp",
        301
    ],
    [
        "2年",
        "5H",
        206,
        "石元　萌愛",
        "40912134@g.kochinet.ed.jp",
        302
    ],
    [
        "2年",
        "5H",
        206,
        "石元　萌愛",
        "40912134@g.kochinet.ed.jp",
        303
    ],
    [
        "2年",
        "5H",
        208,
        "松下 朋滉",
        "37612006@g.kochinet.ed.jp",
        304
    ],
    [
        "2年",
        "5H",
        208,
        "松下 朋滉",
        "37612006@g.kochinet.ed.jp",
        305
    ],
    [
        "2年",
        "5H",
        210,
        "柴山　奏音",
        "12112315@g.kochinet.ed.jp",
        306
    ],
    [
        "2年",
        "5H",
        210,
        "柴山　奏音",
        "12112315@g.kochinet.ed.jp",
        307
    ],
    [
        "2年",
        "5H",
        211,
        "田渕   圭真",
        "12112217@g.kochinet.ed.jp",
        308
    ],
    [
        "2年",
        "5H",
        211,
        "田渕   圭真",
        "12112217@g.kochinet.ed.jp",
        309
    ],
    [
        "2年",
        "5H",
        212,
        "大野裕太",
        "12112408@g.kochinet.ed.jp",
        310
    ],
    [
        "2年",
        "5H",
        212,
        "大野裕太",
        "12112408@g.kochinet.ed.jp",
        311
    ],
    [
        "2年",
        "5H",
        214,
        "濱崎　ひまわり",
        "37612012@g.kochinet.ed.jp",
        312
    ],
    [
        "2年",
        "5H",
        214,
        "濱崎　ひまわり",
        "37612012@g.kochinet.ed.jp",
        313
    ],
    [
        "2年",
        "5H",
        215,
        "矢野  孜門",
        "12112634@g.kochinet.ed.jp",
        314
    ],
    [
        "2年",
        "5H",
        216,
        "和食 日南乃",
        "12112640@g.kochinet.ed.jp",
        315
    ],
    [
        "2年",
        "5H",
        216,
        "和食 日南乃",
        "12112640@g.kochinet.ed.jp",
        316
    ],
    [
        "2年",
        "5H",
        218,
        "岩戸　柚奈",
        "12112503@g.kochinet.ed.jp",
        317
    ],
    [
        "2年",
        "5H",
        218,
        "岩戸　柚奈",
        "12112503@g.kochinet.ed.jp",
        318
    ],
    [
        "2年",
        "5H",
        219,
        "竹村　日和",
        "12111217@g.kochinet.ed.jp",
        319
    ],
    [
        "2年",
        "5H",
        219,
        "竹村　日和",
        "12111217@g.kochinet.ed.jp",
        320
    ],
    [
        "3年",
        "5H",
        220,
        "五藤　潤",
        "12111415@g.kochinet.ed.jp",
        321
    ],
    [
        "3年",
        "5H",
        220,
        "五藤　潤",
        "12111415@g.kochinet.ed.jp",
        322
    ],
    [
        "3年",
        "5H",
        221,
        "赤井　彰仁",
        "12111501@g.kochinet.ed.jp",
        323
    ],
    [
        "3年",
        "5H",
        221,
        "赤井　彰仁",
        "12111501@g.kochinet.ed.jp",
        324
    ],
    [
        "3年",
        "5H",
        222,
        "前田 悠貴",
        "12111432@g.kochinet.ed.jp",
        325
    ],
    [
        "3年",
        "5H",
        223,
        "山﨑　晴琉",
        "12111138@g.kochinet.ed.jp",
        326
    ],
    [
        "3年",
        "5H",
        224,
        "松木   咲良",
        "12111536@g.kochinet.ed.jp",
        327
    ],
    [
        "3年",
        "5H",
        224,
        "松木   咲良",
        "12111536@g.kochinet.ed.jp",
        328
    ],
    [
        "3年",
        "5H",
        225,
        "徳弘 奈保",
        "12111623@g.kochinet.ed.jp",
        329
    ],
    [
        "3年",
        "5H",
        225,
        "徳弘 奈保",
        "12111623@g.kochinet.ed.jp",
        330
    ],
    [
        "3年",
        "5H",
        226,
        "田原  航",
        "12111316@g.kochinet.ed.jp",
        331
    ],
    [
        "3年",
        "5H",
        226,
        "田原  航",
        "12111316@g.kochinet.ed.jp",
        332
    ],
    [
        "3年",
        "5H",
        227,
        "田口 統悟",
        "12111619@g.kochinet.ed.jp",
        333
    ],
    [
        "3年",
        "5H",
        227,
        "田口 統悟",
        "12111619@g.kochinet.ed.jp",
        334
    ],
    [
        "3年",
        "5H",
        228,
        "小松 瑞稀",
        "12111210@g.kochinet.ed.jp",
        335
    ],
    [
        "3年",
        "5H",
        228,
        "小松 瑞稀",
        "12111210@g.kochinet.ed.jp",
        336
    ],
    [
        "3年",
        "5H",
        229,
        "中岡　莉瑚",
        "12111123@g.kochinet.ed.jp",
        337
    ],
    [
        "3年",
        "5H",
        229,
        "中岡　莉瑚",
        "12111123@g.kochinet.ed.jp",
        338
    ],
    [
        "3年",
        "5H",
        230,
        "山下　紗葵",
        "12111339@g.kochinet.ed.jp",
        339
    ],
    [
        "3年",
        "5H",
        230,
        "山下　紗葵",
        "12111339@g.kochinet.ed.jp",
        340
    ],
    [
        "3年",
        "5H",
        231,
        "藤戸 帆花",
        "12111532@g.kochinet.ed.jp",
        341
    ],
    [
        "3年",
        "5H",
        232,
        "津野 夏希",
        "12111319@g.kochinet.ed.jp",
        342
    ],
    [
        "3年",
        "5H",
        232,
        "津野 夏希",
        "12111319@g.kochinet.ed.jp",
        343
    ],
    [
        "3年",
        "5H",
        233,
        "中山 桃嘉",
        "12111322@g.kochinet.ed.jp",
        344
    ],
    [
        "3年",
        "5H",
        233,
        "中山 桃嘉",
        "12111322@g.kochinet.ed.jp",
        345
    ],
    [
        "3年",
        "5H",
        234,
        "濱田　勝己",
        "12111429@g.kochinet.ed.jp",
        346
    ],
    [
        "3年",
        "5H",
        235,
        "森野　勝",
        "12111537@g.kochinet.ed.jp",
        347
    ],
    [
        "3年",
        "5H",
        235,
        "森野　勝",
        "12111537@g.kochinet.ed.jp",
        348
    ],
    [
        "1年",
        "6H",
        237,
        "水口　沙樹",
        "37713062@g.kochinet.ed.jp",
        349
    ],
    [
        "1年",
        "6H",
        237,
        "水口　沙樹",
        "37713062@g.kochinet.ed.jp",
        350
    ],
    [
        "1年",
        "6H",
        238,
        "島崎　遼真",
        "4171367@g.kochinet.ed.jp",
        351
    ],
    [
        "1年",
        "6H",
        238,
        "島崎　遼真",
        "4171367@g.kochinet.ed.jp",
        352
    ],
    [
        "1年",
        "6H",
        240,
        "中平　衣莉",
        "38813021@g.kochinet.ed.jp",
        353
    ],
    [
        "1年",
        "6H",
        240,
        "中平　衣莉",
        "38813021@g.kochinet.ed.jp",
        354
    ],
    [
        "1年",
        "6H",
        241,
        "中野　瑚春",
        "45713009@g.kochinet.ed.jp",
        355
    ],
    [
        "1年",
        "6H",
        241,
        "中野　瑚春",
        "45713009@g.kochinet.ed.jp",
        356
    ],
    [
        "1年",
        "6H",
        242,
        "谷口　雨記",
        "12112121@g.kochinet.ed.jp",
        357
    ],
    [
        "1年",
        "6H",
        242,
        "谷口　雨記",
        "12112121@g.kochinet.ed.jp",
        358
    ],
    [
        "2年",
        "6H",
        243,
        "谷本　萌愛",
        "12112215@g.kochinet.ed.jp",
        359
    ],
    [
        "2年",
        "6H",
        243,
        "谷本　萌愛",
        "12112215@g.kochinet.ed.jp",
        360
    ],
    [
        "2年",
        "6H",
        244,
        "別府 仁成",
        "39312059@g.kochinet.ed.jp",
        361
    ],
    [
        "2年",
        "6H",
        244,
        "別府 仁成",
        "39312059@g.kochinet.ed.jp",
        362
    ],
    [
        "2年",
        "6H",
        245,
        "常石 実里",
        "39312147@g.kochinet.ed.jp",
        363
    ],
    [
        "2年",
        "6H",
        245,
        "常石 実里",
        "39312147@g.kochinet.ed.jp",
        364
    ],
    [
        "2年",
        "6H",
        246,
        "髙田　芽衣",
        "12112415@g.kochinet.ed.jp",
        365
    ],
    [
        "2年",
        "6H",
        246,
        "髙田　芽衣",
        "12112415@g.kochinet.ed.jp",
        366
    ],
    [
        "2年",
        "6H",
        247,
        "田所　星那",
        "44812054@g.kochinet.ed.jp",
        367
    ],
    [
        "2年",
        "6H",
        247,
        "田所　星那",
        "44812054@g.kochinet.ed.jp",
        368
    ],
    [
        "2年",
        "6H",
        248,
        "安並 未来",
        "41112020@g.kochinet.ed.jp",
        369
    ],
    [
        "2年",
        "6H",
        248,
        "安並 未来",
        "41112020@g.kochinet.ed.jp",
        370
    ],
    [
        "2年",
        "6H",
        249,
        "植村　優人",
        "41512012@g.kochinet.ed.jp",
        371
    ],
    [
        "2年",
        "6H",
        249,
        "植村　優人",
        "41512012@g.kochinet.ed.jp",
        372
    ],
    [
        "2年",
        "6H",
        250,
        "樽井   祥",
        "37312014@g.kochinet.ed.jp",
        373
    ],
    [
        "2年",
        "6H",
        250,
        "樽井   祥",
        "37312014@g.kochinet.ed.jp",
        374
    ],
    [
        "2年",
        "6H",
        251,
        "森岡  優",
        "3651231@g.kochinet.ed.jp",
        375
    ],
    [
        "2年",
        "6H",
        251,
        "森岡  優",
        "3651231@g.kochinet.ed.jp",
        376
    ],
    [
        "2年",
        "6H",
        252,
        "山口 賢晟",
        "12112439@g.kochinet.ed.jp",
        377
    ],
    [
        "2年",
        "6H",
        253,
        "岡　いぶき",
        "12112606@g.kochinet.ed.jp",
        378
    ],
    [
        "2年",
        "6H",
        253,
        "岡　いぶき",
        "12112606@g.kochinet.ed.jp",
        379
    ],
    [
        "2年",
        "6H",
        254,
        "氏原 聖也",
        "12112305@g.kochinet.ed.jp",
        380
    ],
    [
        "2年",
        "6H",
        254,
        "氏原 聖也",
        "12112305@g.kochinet.ed.jp",
        381
    ],
    [
        "2年",
        "6H",
        255,
        "豊嶋  愛夏",
        "12112623@g.kochinet.ed.jp",
        382
    ],
    [
        "2年",
        "6H",
        255,
        "豊嶋  愛夏",
        "12112623@g.kochinet.ed.jp",
        383
    ],
    [
        "2年",
        "6H",
        257,
        "徳原　朔也",
        "12112419@g.kochinet.ed.jp",
        384
    ],
    [
        "2年",
        "6H",
        257,
        "徳原　朔也",
        "12112419@g.kochinet.ed.jp",
        385
    ],
    [
        "2年",
        "6H",
        258,
        "濱口　仁",
        "12112127@g.kochinet.ed.jp",
        386
    ],
    [
        "2年",
        "6H",
        258,
        "濱口　仁",
        "12112127@g.kochinet.ed.jp",
        387
    ],
    [
        "2年",
        "6H",
        259,
        "隅田 千晴",
        "12112518@g.kochinet.ed.jp",
        388
    ],
    [
        "2年",
        "6H",
        259,
        "隅田 千晴",
        "12112518@g.kochinet.ed.jp",
        389
    ],
    [
        "2年",
        "6H",
        260,
        "岡林　佑星",
        "12112106@g.kochinet.ed.jp",
        390
    ],
    [
        "2年",
        "6H",
        260,
        "岡林　佑星",
        "12112106@g.kochinet.ed.jp",
        391
    ],
    [
        "2年",
        "6H",
        261,
        "中村　亮太",
        "3741215@g.kochinet.ed.jp",
        392
    ],
    [
        "2年",
        "6H",
        261,
        "中村　亮太",
        "3741215@g.kochinet.ed.jp",
        393
    ],
    [
        "2年",
        "6H",
        263,
        "髙野 敦",
        "12112519@g.kochinet.ed.jp",
        394
    ],
    [
        "2年",
        "6H",
        263,
        "髙野 敦",
        "12112519@g.kochinet.ed.jp",
        395
    ],
    [
        "2年",
        "6H",
        264,
        "大石 楓太",
        "12112406@g.kochinet.ed.jp",
        396
    ],
    [
        "2年",
        "6H",
        264,
        "大石 楓太",
        "12112406@g.kochinet.ed.jp",
        397
    ],
    [
        "2年",
        "6H",
        265,
        "中川　耕史郎",
        "12112325@g.kochinet.ed.jp",
        398
    ],
    [
        "2年",
        "6H",
        265,
        "中川　耕史郎",
        "12112325@g.kochinet.ed.jp",
        399
    ],
    [
        "2年",
        "6H",
        266,
        "林 琴美",
        "4171217@g.kochinet.ed.jp",
        400
    ],
    [
        "2年",
        "6H",
        266,
        "林 琴美",
        "4171217@g.kochinet.ed.jp",
        401
    ],
    [
        "2年",
        "6H",
        267,
        "尾木   青海",
        "1601206@g.kochinet.ed.jp",
        402
    ],
    [
        "2年",
        "6H",
        267,
        "尾木   青海",
        "1601206@g.kochinet.ed.jp",
        403
    ],
    [
        "2年",
        "6H",
        268,
        "高橋 慶",
        "12112118@g.kochinet.ed.jp",
        404
    ],
    [
        "2年",
        "6H",
        268,
        "高橋 慶",
        "12112118@g.kochinet.ed.jp",
        405
    ],
    [
        "2年",
        "6H",
        269,
        "増田　心結",
        "12112433@g.kochinet.ed.jp",
        406
    ],
    [
        "2年",
        "6H",
        270,
        "中平 舜也",
        "12111530@g.kochinet.ed.jp",
        407
    ],
    [
        "2年",
        "6H",
        270,
        "中平 舜也",
        "12111530@g.kochinet.ed.jp",
        408
    ],
    [
        "3年",
        "6H",
        271,
        "濱川　幸太",
        "12111326@g.kochinet.ed.jp",
        409
    ],
    [
        "3年",
        "6H",
        272,
        "松田 萌花",
        "12111232@g.kochinet.ed.jp",
        410
    ],
    [
        "3年",
        "6H",
        272,
        "松田 萌花",
        "12111232@g.kochinet.ed.jp",
        411
    ],
    [
        "3年",
        "6H",
        274,
        "猪野　泰成",
        "12111507@g.kochinet.ed.jp",
        412
    ],
    [
        "3年",
        "6H",
        274,
        "猪野　泰成",
        "12111507@g.kochinet.ed.jp",
        413
    ],
    [
        "3年",
        "6H",
        275,
        "佐竹　こてつ",
        "12111418@g.kochinet.ed.jp",
        414
    ],
    [
        "3年",
        "6H",
        275,
        "佐竹　こてつ",
        "12111418@g.kochinet.ed.jp",
        415
    ],
    [
        "3年",
        "6H",
        276,
        "岡崎 蓮聖",
        "12111105@g.kochinet.ed.jp",
        416
    ],
    [
        "3年",
        "6H",
        276,
        "岡崎 蓮聖",
        "12111105@g.kochinet.ed.jp",
        417
    ],
    [
        "3年",
        "6H",
        277,
        "福井　花音",
        "12111134@g.kochinet.ed.jp",
        418
    ],
    [
        "3年",
        "6H",
        277,
        "福井　花音",
        "12111134@g.kochinet.ed.jp",
        419
    ],
    [
        "3年",
        "6H",
        278,
        "森岡 心",
        "12111236@g.kochinet.ed.jp",
        420
    ],
    [
        "3年",
        "6H",
        278,
        "森岡 心",
        "12111236@g.kochinet.ed.jp",
        421
    ],
    [
        "3年",
        "6H",
        280,
        "中野　裕斗",
        "38013049@g.kochinet.ed.jp",
        422
    ],
    [
        "3年",
        "6H",
        280,
        "中野　裕斗",
        "38013049@g.kochinet.ed.jp",
        423
    ],
    [
        "1年",
        "7H",
        282,
        "西坂 優希",
        "39113098@g.kochinet.ed.jp",
        424
    ],
    [
        "1年",
        "7H",
        282,
        "西坂 優希",
        "39113098@g.kochinet.ed.jp",
        425
    ],
    [
        "1年",
        "7H",
        284,
        "松浦 直希",
        "41213061@g.kochinet.ed.jp",
        426
    ],
    [
        "1年",
        "7H",
        284,
        "松浦 直希",
        "41213061@g.kochinet.ed.jp",
        427
    ],
    [
        "1年",
        "7H",
        286,
        "橋田　璃子",
        "41213047@g.kochinet.ed.jp",
        428
    ],
    [
        "1年",
        "7H",
        286,
        "橋田　璃子",
        "41213047@g.kochinet.ed.jp",
        429
    ],
    [
        "1年",
        "7H",
        287,
        "萩野 友翔",
        "12113020@g.kochinet.ed.jp",
        430
    ],
    [
        "1年",
        "7H",
        287,
        "萩野 友翔",
        "12113020@g.kochinet.ed.jp",
        431
    ],
    [
        "1年",
        "7H",
        288,
        "大元 彩奈",
        "36913016@g.kochinet.ed.jp",
        432
    ],
    [
        "1年",
        "7H",
        289,
        "又川　穂香",
        "38513026@g.kochinet.ed.jp",
        433
    ],
    [
        "1年",
        "7H",
        290,
        "西笛 裕人",
        "12112724@g.kochinet.ed.jp",
        434
    ],
    [
        "1年",
        "7H",
        290,
        "西笛 裕人",
        "12112724@g.kochinet.ed.jp",
        435
    ],
    [
        "2年",
        "7H",
        291,
        "山﨑 萌亜",
        "12112734@g.kochinet.ed.jp",
        436
    ],
    [
        "2年",
        "7H",
        291,
        "山﨑 萌亜",
        "12112734@g.kochinet.ed.jp",
        437
    ],
    [
        "2年",
        "7H",
        292,
        "野中 琉翔",
        "43112170@g.kochinet.ed.jp",
        438
    ],
    [
        "2年",
        "7H",
        293,
        "天畠　雄雅",
        "12112702@g.kochinet.ed.jp",
        439
    ],
    [
        "2年",
        "7H",
        293,
        "天畠　雄雅",
        "12112702@g.kochinet.ed.jp",
        440
    ],
    [
        "2年",
        "7H",
        294,
        "岡田 悠樹",
        "12112707@g.kochinet.ed.jp",
        441
    ],
    [
        "2年",
        "7H",
        294,
        "岡田 悠樹",
        "12112707@g.kochinet.ed.jp",
        442
    ],
    [
        "2年",
        "7H",
        295,
        "川渕　日咲野",
        "12112711@g.kochinet.ed.jp",
        443
    ],
    [
        "2年",
        "7H",
        295,
        "川渕　日咲野",
        "12112711@g.kochinet.ed.jp",
        444
    ],
    [
        "2年",
        "7H",
        296,
        "渡部　希望",
        "4171250@g.kochinet.ed.jp",
        445
    ],
    [
        "2年",
        "7H",
        296,
        "渡部　希望",
        "4171250@g.kochinet.ed.jp",
        446
    ],
    [
        "2年",
        "7H",
        297,
        "林 和冶",
        "12112726@g.kochinet.ed.jp",
        447
    ],
    [
        "2年",
        "7H",
        297,
        "林 和冶",
        "12112726@g.kochinet.ed.jp",
        448
    ],
    [
        "2年",
        "7H",
        298,
        "松本 新太",
        "12112730@g.kochinet.ed.jp",
        449
    ],
    [
        "2年",
        "7H",
        298,
        "松本 新太",
        "12112730@g.kochinet.ed.jp",
        450
    ],
    [
        "2年",
        "7H",
        299,
        "松浦　伸哉",
        "12112729@g.kochinet.ed.jp",
        451
    ],
    [
        "2年",
        "7H",
        299,
        "松浦　伸哉",
        "12112729@g.kochinet.ed.jp",
        452
    ],
    [
        "2年",
        "7H",
        300,
        "西川　海斗",
        "12112723@g.kochinet.ed.jp",
        453
    ],
    [
        "2年",
        "7H",
        300,
        "西川　海斗",
        "12112723@g.kochinet.ed.jp",
        454
    ],
    [
        "2年",
        "7H",
        301,
        "森光 琉貴",
        "12112733@g.kochinet.ed.jp",
        455
    ],
    [
        "2年",
        "7H",
        301,
        "森光 琉貴",
        "12112733@g.kochinet.ed.jp",
        456
    ],
    [
        "3年",
        "7H",
        302,
        "片岡　裕太",
        "12111703@g.kochinet.ed.jp",
        457
    ],
    [
        "3年",
        "7H",
        302,
        "片岡　裕太",
        "12111703@g.kochinet.ed.jp",
        458
    ],
    [
        "3年",
        "7H",
        303,
        "竹村　光貴",
        "12111714@g.kochinet.ed.jp",
        459
    ],
    [
        "3年",
        "4H",
        "",
        "宮本　智貴",
        "",
        460
    ],
    [
        "3年",
        "4H",
        "",
        "宮本　智貴",
        "",
        461
    ],
    [
        "3年",
        "7H",
        305,
        "齋藤 愛奈",
        "12111708@g.kochinet.ed.jp",
        462
    ],
    [
        "3年",
        "7H",
        305,
        "齋藤 愛奈",
        "12111708@g.kochinet.ed.jp",
        463
    ],
    [
        "3年",
        "7H",
        306,
        "熊野　ひなみ",
        "12111706@g.kochinet.ed.jp",
        464
    ],
    [
        "3年",
        "7H",
        306,
        "熊野　ひなみ",
        "12111706@g.kochinet.ed.jp",
        465
    ],
    [
        "3年",
        "7H",
        308,
        "西岡  宏祐",
        "12111720@g.kochinet.ed.jp",
        466
    ],
    [
        "3年",
        "7H",
        308,
        "西岡  宏祐",
        "12111720@g.kochinet.ed.jp",
        467
    ],
    [
        "3年",
        "7H",
        309,
        "吉岡 莉緒",
        "12111732@g.kochinet.ed.jp",
        468
    ],
    [
        "3年",
        "7H",
        309,
        "吉岡 莉緒",
        "12111732@g.kochinet.ed.jp",
        469
    ],
    [
        "3年",
        "7H",
        310,
        "濵田 汐音",
        "12111723@g.kochinet.ed.jp",
        470
    ],
    [
        "3年",
        "7H",
        310,
        "濵田 汐音",
        "12111723@g.kochinet.ed.jp",
        471
    ],
    [
        "3年",
        "7H",
        311,
        "吉本 颯",
        "12111734@g.kochinet.ed.jp",
        472
    ],
    [
        "3年",
        "7H",
        311,
        "吉本 颯",
        "12111734@g.kochinet.ed.jp",
        473
    ],
    [
        "3年",
        "7H",
        312,
        "中平　莉央",
        "12111717@g.kochinet.ed.jp",
        474
    ],
    [
        "3年",
        "7H",
        312,
        "中平　莉央",
        "12111717@g.kochinet.ed.jp",
        475
    ],
    [
        "3年",
        "7H",
        313,
        "松丸 碧",
        "12111728@g.kochinet.ed.jp",
        476
    ],
    [
        "3年",
        "7H",
        313,
        "松丸 碧",
        "12111728@g.kochinet.ed.jp",
        477
    ],
    [
        "3年",
        "7H",
        315,
        "友草春香",
        "12111716@g.kochinet.ed.jp",
        478
    ],
    [
        "3年",
        "7H",
        315,
        "友草春香",
        "12111716@g.kochinet.ed.jp",
        479
    ],
    [
        "3年",
        "7H",
        317,
        "堀切　美玖",
        "12111727@g.kochinet.ed.jp",
        480
    ],
    [
        "3年",
        "7H",
        317,
        "堀切　美玖",
        "12111727@g.kochinet.ed.jp",
        481
    ],
    [
        "3年",
        "7H",
        318,
        "藤本    小雪",
        "12111726@g.kochinet.ed.jp",
        482
    ],
    [
        "3年",
        "7H",
        318,
        "藤本    小雪",
        "12111726@g.kochinet.ed.jp",
        483
    ],
    [
        "3年",
        "7H",
        320,
        "安岡 樹希",
        "12111731@g.kochinet.ed.jp",
        484
    ],
    [
        "3年",
        "7H",
        320,
        "安岡 樹希",
        "12111731@g.kochinet.ed.jp",
        485
    ],
    [
        "3年",
        "7H",
        322,
        "片岡　留空",
        "12111704@g.kochinet.ed.jp",
        486
    ],
    [
        "3年",
        "7H",
        322,
        "片岡　留空",
        "12111704@g.kochinet.ed.jp",
        487
    ],
    [
        "3年",
        "7H",
        323,
        "下元　太央",
        "12111711@g.kochinet.ed.jp",
        488
    ],
    [
        "3年",
        "7H",
        323,
        "下元　太央",
        "12111711@g.kochinet.ed.jp",
        489
    ],
    [
        "先生",
        "先生",
        326,
        "仙頭  昇陽",
        "12111117@g.kochinet.ed.jp",
        490
    ],
    [
        "先生",
        "先生",
        326,
        "仙頭  昇陽",
        "12111117@g.kochinet.ed.jp",
        491
    ],
    [
        "先生",
        "先生",
        327,
        "明神 東吾",
        "12111729@g.kochinet.ed.jp",
        492
    ],
    [
        "先生",
        "先生",
        327,
        "明神 東吾",
        "12111729@g.kochinet.ed.jp",
        493
    ],
    [
        "",
        "",
        328,
        "阪本　音媛",
        "12112617@g.kochinet.ed.jp",
        494
    ],
    [
        "",
        "",
        328,
        "阪本　音媛",
        "12112617@g.kochinet.ed.jp",
        495
    ],
    [
        "",
        "",
        329,
        "西 音羽",
        "39313257@g.kochinet.ed.jp",
        496
    ],
    [
        "",
        "",
        329,
        "西 音羽",
        "39313257@g.kochinet.ed.jp",
        497
    ],
    [
        "",
        "",
        331,
        "小井手 羽希",
        "37213076@g.kochinet.ed.jp",
        498
    ],
    [
        "",
        "",
        331,
        "小井手 羽希",
        "37213076@g.kochinet.ed.jp",
        499
    ],
    [
        "3年",
        "7H",
        "",
        "西　てるあき",
        "",
        500
    ]
]
